<!-- dflook/terraform-github-actions backend_type= workspace=github_pr_comment_refactor-2 backend=2c6318155d18ec718cf6769834eeee41a659315fe24c68411508331ef9a0c9e8 -->Terraform plan in __tests/terraform-cloud/1.0__ in the __github_pr_comment_refactor-2__ workspace
With var files: `tests/terraform-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables="from_variables"`
    <detailsFalse>
    <summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

    ```hcl
    Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
    ```
    </details>
    
:memo: Plan generated in [Test remote backend #388](https://github.com/dflook/terraform-github-actions/actions/runs/1878360835)